{"format": "keras", "nodes": [{"name": "discriminator", "id": "discriminator", "class_name": "Functional", "output_shape": [[null, 1], [null, 1]], "num_parameters": 403777}, {"name": "generator", "id": "generator", "class_name": "Functional", "output_shape": [null, 20, 24, 2], "num_parameters": 8896514}], "edges": []}